src/Documents/НазначениеСкидокШапки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НазначениеСкидокШапки</Name>
			<Comment>Назначение общих скидок на документ в целом</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.СкидкиШапки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйСкладскойОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОконачанияДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
					<Comment>Таблица скидок</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Comment>Скидка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагВытеснения</Name>
							<Comment>Истина - скидка вытесняющая, Ложь - скидка может использоваться совместно</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидки</Name>
							<Comment>Процент от суммы документа или сумма для абсолютных скидок</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЧека</Name>
							<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Comment>Карта, на которую назначается скидка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНакопления</Name>
							<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачВремя</Name>
							<Comment>Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонВремя</Name>
							<Comment>Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниНедели</Name>
							<Comment>Маска дней недели 0/1 для определения действия скидки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПрайсЛистаПодарка</Name>
							<Comment>Прайс-лист подарка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПрайсЛистов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяСуммаПодарка</Name>
							<Comment>Максимальная сумма подарка</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад/Отдел</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСкидки</Name>
							<Comment>Идентификатор скидки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСкидкиВОборудовании</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СкидкиШапки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СкидкиШапки</Name>
			<Comment>Сведения о скидках назначаемых на документы в целом</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Comment>Действует или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагВытеснения</Name>
					<Comment>Флаг вытеснения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПрайсЛистаПодарка</Name>
					<Comment>Прайс-лист подарка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрайсЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСуммаПодарка</Name>
					<Comment>Максимальная сумма на которую можно сделать подарок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения скидки. Если момент больше чем "момент последней загрузки" оборудования, то эту скидку надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкидки</Name>
					<Comment>Идентификатор скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучнаяСкидка</Name>
					<Comment>Истина, если скидка задается в ручную. Ложь, если скидка автоматическая</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачВремя</Name>
					<Comment>Время начала действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонВремя</Name>
					<Comment>Время окончания действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДниНедели</Name>
					<Comment>Дни недели, когда действительна скидка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоПодарок</Name>
					<Comment>Истина, если скидка является подарком. Ложь, в противном случае</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Comment>Карта, на которую назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыНакопленияНаКарте</Name>
					<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалОбслуживания</Name>
					<Comment>Зал/Склад/Отдел в котором действует данная скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Свойство документа, от которого зависеть скидка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыЧека</Name>
					<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия цен</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСкидкиВОборудовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СкидкиСпособВычисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СкидкиСпособВычисления</Name>
			<Comment>Способ вычисления</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абсолютная</Name>
					<Comment>Абсолютная скидка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Относительная</Name>
					<Comment>Относительная скидка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяЦена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСкидок</Name>
			<Comment>Виды начисления скидок</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаДокумент</Name>
					<Comment>Скидка назначается на документ в целом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСтрокуДокумента</Name>
					<Comment>Скидка назначается на товарную строку документа</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/НазначениеСкидокШапки/Ext/ManagerModule.bsl
// Модуль менеджера документа "Назначение скидок шапки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Функция получает таблицу скидок и их параметров действия
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьТаблицуСкидок(Объект) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НазначениеСкидокШапкиСкидки.Скидка.РучнаяСкидка КАК РучнаяСкидка,
	|	НазначениеСкидокШапкиСкидки.НачВремя,
	|	НазначениеСкидокШапкиСкидки.КонВремя,
	|	НазначениеСкидокШапкиСкидки.ДниНедели,
	|	НазначениеСкидокШапкиСкидки.Скидка.ЭтоПодарок КАК ЭтоПодарок,
	|	НазначениеСкидокШапкиСкидки.ДисконтнаяКарта,
	|	НазначениеСкидокШапкиСкидки.СуммаНакопления КАК ОтСуммыНакопленияНаКарте,
	|	НазначениеСкидокШапкиСкидки.СкладКомпании КАК ЗалОбслуживания,
	|	НазначениеСкидокШапкиСкидки.Свойство,
	|	НазначениеСкидокШапкиСкидки.СуммаЧека КАК ОтСуммыЧека,
	|	НазначениеСкидокШапкиСкидки.Скидка,
	|	НазначениеСкидокШапкиСкидки.Ссылка КАК РегистраторСкидки,
	|	НазначениеСкидокШапкиСкидки.ЗначениеСкидки,
	|	НазначениеСкидокШапкиСкидки.Скидка.СпособВычисления КАК СпособВычисления,
	|	НазначениеСкидокШапкиСкидки.ФлагВытеснения,
	|	НазначениеСкидокШапкиСкидки.ВидПрайсЛистаПодарка,
	|	НазначениеСкидокШапкиСкидки.МаксимальнаяСуммаПодарка,
	|	НазначениеСкидокШапкиСкидки.ИдентификаторСкидки,
	|	НазначениеСкидокШапкиСкидки.ИдентификаторСкидкиВОборудовании
	|ПОМЕСТИТЬ
	|	НазначениеСкидокШапки
	|ИЗ
	|	Документ.НазначениеСкидокШапки.Скидки КАК НазначениеСкидокШапкиСкидки
	|ГДЕ
	|	НазначениеСкидокШапкиСкидки.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	&СрокДействия КАК СрокДействия,
	|	ТаблицаСкидок.Скидка
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	НазначениеСкидокШапки КАК ТаблицаСкидок
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НазначениеСкидокШапкиСкидки.РучнаяСкидка КАК РучнаяСкидка,
	|	НазначениеСкидокШапкиСкидки.НачВремя,
	|	НазначениеСкидокШапкиСкидки.КонВремя,
	|	НазначениеСкидокШапкиСкидки.ДниНедели,
	|	НазначениеСкидокШапкиСкидки.ЭтоПодарок КАК ЭтоПодарок,
	|	НазначениеСкидокШапкиСкидки.ДисконтнаяКарта,
	|	НазначениеСкидокШапкиСкидки.ОтСуммыНакопленияНаКарте КАК ОтСуммыНакопленияНаКарте,
	|	НазначениеСкидокШапкиСкидки.ЗалОбслуживания КАК ЗалОбслуживания,
	|	НазначениеСкидокШапкиСкидки.Свойство,
	|	НазначениеСкидокШапкиСкидки.ОтСуммыЧека КАК ОтСуммыЧека,
	|	НазначениеСкидокШапкиСкидки.Скидка,
	|	НазначениеСкидокШапкиСкидки.РегистраторСкидки КАК РегистраторСкидки,
	|	НазначениеСкидокШапкиСкидки.ЗначениеСкидки,
	|	НазначениеСкидокШапкиСкидки.СпособВычисления КАК СпособВычисления,
	|	НазначениеСкидокШапкиСкидки.ФлагВытеснения,
	|	НазначениеСкидокШапкиСкидки.ВидПрайсЛистаПодарка,
	|	НазначениеСкидокШапкиСкидки.МаксимальнаяСуммаПодарка,
	|	НазначениеСкидокШапкиСкидки.ИдентификаторСкидки,
	|	НазначениеСкидокШапкиСкидки.ИдентификаторСкидкиВОборудовании,
	|	ЕСТЬNULL(СкидкиШапкиСрезПоследних.Действует, ЛОЖЬ) КАК СкидкаУстановлена
	|ИЗ
	|	НазначениеСкидокШапки КАК НазначениеСкидокШапкиСкидки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкидкиШапки.СрезПоследних(
	|				&Дата,
	|				(ПодразделениеКомпании, СрокДействия, Скидка) В
	|				(ВЫБРАТЬ ПодразделениеКомпании, СрокДействия, Скидка ИЗ ТаблицаСкидок)) КАК СкидкиШапкиСрезПоследних
	|ПО
	|	НазначениеСкидокШапкиСкидки.НачВремя 			= СкидкиШапкиСрезПоследних.НачВремя
	|	И НазначениеСкидокШапкиСкидки.КонВремя 			= СкидкиШапкиСрезПоследних.КонВремя
	|	И НазначениеСкидокШапкиСкидки.ДниНедели 		= СкидкиШапкиСрезПоследних.ДниНедели
	|	И НазначениеСкидокШапкиСкидки.ДисконтнаяКарта 	= СкидкиШапкиСрезПоследних.ДисконтнаяКарта
	|	И НазначениеСкидокШапкиСкидки.ОтСуммыНакопленияНаКарте 	= СкидкиШапкиСрезПоследних.ОтСуммыНакопленияНаКарте
	|	И НазначениеСкидокШапкиСкидки.ЗалОбслуживания 	= СкидкиШапкиСрезПоследних.ЗалОбслуживания
	|	И НазначениеСкидокШапкиСкидки.Свойство			= СкидкиШапкиСрезПоследних.Свойство
	|	И НазначениеСкидокШапкиСкидки.ОтСуммыЧека			= СкидкиШапкиСрезПоследних.ОтСуммыЧека
	|	И НазначениеСкидокШапкиСкидки.Скидка 			= СкидкиШапкиСрезПоследних.Скидка
	|	И НазначениеСкидокШапкиСкидки.ЗначениеСкидки	= СкидкиШапкиСрезПоследних.ЗначениеСкидки
	|	И НазначениеСкидокШапкиСкидки.ИдентификаторСкидкиВОборудовании = СкидкиШапкиСрезПоследних.ИдентификаторСкидкиВОборудовании
	|	И (СкидкиШапкиСрезПоследних.Действует)
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",	Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата",	Новый Граница(Объект.ДатаНачалаДействия, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СрокДействия", 	Объект.ДатаОконачанияДействия);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	
	Возврат Запрос.Выполнить();
КонецФункции // ПолучитьТаблицуСкидок()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("ДатаНачалаДействия");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Скидки");
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("Скидки.Скидка");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы скидки
	УникальныеСкидки = Новый Массив();
	
	УникальныеСкидки.Добавить("Скидка");
	УникальныеСкидки.Добавить("ЗначениеСкидки");
	УникальныеСкидки.Добавить("Свойство");
	УникальныеСкидки.Добавить("ДисконтнаяКарта");
	УникальныеСкидки.Добавить("СуммаНакопления");
	УникальныеСкидки.Добавить("НачВремя");
	УникальныеСкидки.Добавить("КонВремя");
	УникальныеСкидки.Добавить("ДниНедели");
	УникальныеСкидки.Добавить("СкладКомпании");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Скидки", УникальныеСкидки);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", ИСТИНА);
	ПараметрыДействия.Вставить("НеРассчитыватьСкидки", ИСТИНА);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	// Отключим установку цен, так как в данном документе она не нужна
	ПараметрыДействия.ТребуетсяУстановкаЦен = Ложь;
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "Скидки"

// Обработчик события возникающего при изменении данных реквизита "Скидка" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиСкидкаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если НЕ ЗначениеЗаполнено(Строка.Скидка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект, "СпособВычисления", "Скидки") Тогда
		Строка.СпособВычисления = ?(Строка.Скидка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная, Строка(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить()), "%");
	КонецЕсли;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.НазначениеОбщихСкидок Тогда
		// Произведем первоначальное заполнение некоторых полей текущей строки
		Строка.ФлагВытеснения= Строка.Скидка.ФлагВытеснения;
		Если Строка.Скидка.ЭтоПодарок Тогда
			Строка.ЗначениеСкидки           = 0;
		Иначе
			Строка.ВидПрайсЛистаПодарка     = 0;
			Строка.МаксимальнаяСуммаПодарка = 0;
		КонецЕсли;
		Строка.КонВремя  = ?(ЗначениеЗаполнено(Строка.КонВремя), Строка.КонВремя, '00010101235959');
		Строка.ДниНедели = ?(ПустаяСтрока(Строка.ДниНедели), "1111111", Строка.ДниНедели);
		
		// Попробуем заполнить дополнительные поля (для регистра)
		Если ЕстьРеквизит(Объект, "ЭтоПодарок", "Скидки") Тогда
			Строка.ЭтоПодарок = Строка.Скидка.ЭтоПодарок;
		КонецЕсли;
		
		// Проверим корректность заполнения реквизита "ЗначениеСкидки"
		СкидкиЗначениеСкидкиПриИзменении(Объект, Строка, ПараметрыДействия);
		
	Иначе
		// Отмена скидок. Скидка выбрана, найдем ее среди установленных
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СкидкиШапкиСрезПоследних.ФлагВытеснения,
		|	СкидкиШапкиСрезПоследних.ЗначениеСкидки,
		|	СкидкиШапкиСрезПоследних.ДисконтнаяКарта,
		|	СкидкиШапкиСрезПоследних.ОтСуммыНакопленияНаКарте КАК СуммаНакопления,
		|	СкидкиШапкиСрезПоследних.ОтСуммыЧека КАК СуммаЧека,
		|	СкидкиШапкиСрезПоследних.НачВремя,
		|	СкидкиШапкиСрезПоследних.КонВремя,
		|	СкидкиШапкиСрезПоследних.ДниНедели,
		|	СкидкиШапкиСрезПоследних.МаксимальнаяСуммаПодарка,
		|	СкидкиШапкиСрезПоследних.ВидПрайсЛистаПодарка,
		|	СкидкиШапкиСрезПоследних.ЗалОбслуживания КАК СкладКомпании,
		|	СкидкиШапкиСрезПоследних.Свойство
		|ИЗ
		|	РегистрСведений.СкидкиШапки.СрезПоследних(
		|		&Дата,
		|		ПодразделениеКомпании = &ПодразделениеКомпании
		|//ФИЛЬТРЫ
		|			И Скидка = &Скидка) КАК СкидкиШапкиСрезПоследних
		|ГДЕ
		|	СкидкиШапкиСрезПоследних.Действует
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкидкиШапкиСрезПоследних.Период
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Дата",                  Новый Граница(Объект.ДатаНачалаДействия, ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Скидка",                Строка.Скидка);
		
		// Построим дополнительный фильтр по всем заполненным полям текущей строки
		СписокПолей = Новый Структура();
		СписокПолей.Вставить("НачВремя",                 Строка.НачВремя);
		СписокПолей.Вставить("КонВремя",                 Строка.КонВремя);
		СписокПолей.Вставить("ДниНедели",                ?(Строка.ДниНедели = "0000000", "", Строка.ДниНедели));
		СписокПолей.Вставить("ДисконтнаяКарта",          Строка.ДисконтнаяКарта);
		СписокПолей.Вставить("ОтСуммыНакопленияНаКарте", Строка.СуммаНакопления);
		СписокПолей.Вставить("ЗалОбслуживания",          Строка.СкладКомпании);
		СписокПолей.Вставить("Свойство",                 Строка.Свойство);
		СписокПолей.Вставить("ОтСуммыЧека",              Строка.СуммаЧека);
		
		ДопПоляОтбора = "";
		
		Для Каждого ТекПоле Из СписокПолей Цикл
			Если НЕ ЗначениеЗаполнено(ТекПоле.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			ДопПоляОтбора = ДопПоляОтбора + "			И "+ТекПоле.Ключ+" = &"+ТекПоле.Ключ + Символы.ПС;
			Запрос.УстановитьПараметр(ТекПоле.Ключ,ТекПоле.Значение);
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ДопПоляОтбора) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ФИЛЬТРЫ", ДопПоляОтбора);
		КонецЕсли;
		
		// Установим текст запроса и произведем заполнение строки документа найденными данными.
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СкидкиСкидкаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Значение скидки" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиЗначениеСкидкиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если (Строка.ЗначениеСкидки > 100) И (Строка.Скидка.СпособВычисления=Перечисления.СкидкиСпособВычисления.Относительная) И (ЗначениеЗаполнено(Строка.Скидка)) Тогда
		Строка.ЗначениеСкидки = 100;
	КонецЕсли;
	
КонецПроцедуры // СкидкиЗначениеСкидкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Дисконтная карта" в таблице "Скидки".
//
// Параметры:
//  Объект 
//	Строка - строка табличной части
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиДисконтнаяКартаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если НЕ ЗначениеЗаполнено(Строка.ДисконтнаяКарта) Тогда
		Строка.СуммаНакопления = 0;
	КонецЕсли;
	
КонецПроцедуры // СкидкиДисконтнаяКартаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Конечное время" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиКонВремяПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Строка.КонВремя = Дата("00010101000000") Тогда
		Строка.КонВремя  = Дата("00010101235959");
	КонецЕсли;	
	
КонецПроцедуры // СкидкиКонВремяПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.НазначениеСкидокШапки",
		"НазначениеСкидокШапки",
		НСтр("ru = 'Назначение скидок шапки'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НазначениеСкидокШапки") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"НазначениеСкидокШапки",
															НСтр("ru = 'Назначение скидок шапки'"),
															ПечатьНазначениеСкидокШапки(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//	Адрес   - адрес структуры данных во временном хранилище.
//
Функция ПечатьНазначениеСкидокШапки(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НазначениеСкидокШапки_НазначениеСкидокШапки";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества  = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Получим макет печатной формы.
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НазначениеСкидокШапки.НазначениеСкидокШапки");
		
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабличныйДокумент.АвтоМасштаб        = ИСТИНА;
		
		// Получение необходимых областей.
		ОбластьШапкаТаблицы    = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьПодвал 		   = Макет.ПолучитьОбласть("Подвал");
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Заголовок
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры,Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ,Документ.ХозОперация.Наименование);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		Если ЗначениеЗаполнено(Документ.ПодразделениеКомпании) И ЗначениеЗаполнено(Документ.ПодразделениеКомпании.КПП) Тогда
			СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
			ОбластьЗаголовок.Параметры.ОрганизацияПредставление = СтрЗаменить(СтрокаПредставления, ОбщегоНазначения.ПолучитьКППНаДату(Документ.Организация, ДатаДокумента), ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеКомпании, ДатаДокумента));
		Иначе	
			ОбластьЗаголовок.Параметры.ОрганизацияПредставление	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ПодразделениеКомпанииПредставление = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.ПодразделениеКомпании, ДатаДокумента);
		
		// Выводим свойства
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// Готовим шапку
		НомерСтраницы = 2; НомерСтраницыПредыдущий = 2;
		СтруктураИтоговПоСтранице = Новый Структура();
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		// Получим данные для печати.
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НазначениеСкидокШапкиСкидки.НомерСтроки,
		|	НазначениеСкидокШапкиСкидки.Скидка,
		|	НазначениеСкидокШапкиСкидки.Скидка.РучнаяСкидка КАК РучнаяСкидка,
		|	НазначениеСкидокШапкиСкидки.ФлагВытеснения,
		|	НазначениеСкидокШапкиСкидки.Скидка.ЭтоПодарок КАК ЭтоПодарок,
		|	НазначениеСкидокШапкиСкидки.ЗначениеСкидки,
		|	НазначениеСкидокШапкиСкидки.СуммаЧека,
		|	НазначениеСкидокШапкиСкидки.ДисконтнаяКарта,
		|	НазначениеСкидокШапкиСкидки.СуммаНакопления,
		|	НазначениеСкидокШапкиСкидки.НачВремя,
		|	НазначениеСкидокШапкиСкидки.КонВремя,
		|	НазначениеСкидокШапкиСкидки.ДниНедели,
		|	ИСТИНА КАК Пн,
		|	ИСТИНА КАК Вт,
		|	ИСТИНА КАК Ср,
		|	ИСТИНА КАК Чт,
		|	ИСТИНА КАК Пт,
		|	ИСТИНА КАК Сб,
		|	ИСТИНА КАК Вс,
		|	НазначениеСкидокШапкиСкидки.ВидПрайсЛистаПодарка,
		|	НазначениеСкидокШапкиСкидки.МаксимальнаяСуммаПодарка,
		|	НазначениеСкидокШапкиСкидки.СкладКомпании,
		|	НазначениеСкидокШапкиСкидки.Свойство
		|ИЗ
		|	Документ.НазначениеСкидокШапки.Скидки КАК НазначениеСкидокШапкиСкидки
		|ГДЕ
		|	НазначениеСкидокШапкиСкидки.Ссылка = &Ссылка";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		// Перебор строк
		ВыборкаТабличнойЧасти = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			// Заполняем данные строки.
			ДниНедели = СтрокаТабличнойЧасти.ДниНедели;
			СтрокаТабличнойЧасти.Пн = (Сред(ДниНедели,1,1)="1");
			СтрокаТабличнойЧасти.Вт = (Сред(ДниНедели,2,1)="1");
			СтрокаТабличнойЧасти.Ср = (Сред(ДниНедели,3,1)="1");
			СтрокаТабличнойЧасти.Чт = (Сред(ДниНедели,4,1)="1");
			СтрокаТабличнойЧасти.Пт = (Сред(ДниНедели,5,1)="1");
			СтрокаТабличнойЧасти.Сб = (Сред(ДниНедели,6,1)="1");
			СтрокаТабличнойЧасти.Вс = (Сред(ДниНедели,7,1)="1");
			
			// Применим форматирование к полям строки.
			ОбластьСтрока.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтрока.Параметры.ЗначениеСкидки				= Формат(СтрокаТабличнойЧасти.ЗначениеСкидки, ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаЧека					= Формат(СтрокаТабличнойЧасти.СуммаЧека, ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаНакопления				= Формат(СтрокаТабличнойЧасти.СуммаНакопления, ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.МаксимальнаяСуммаПодарка	= Формат(СтрокаТабличнойЧасти.МаксимальнаяСуммаПодарка, ФорматВыводаСуммы);
			
			// Выводим строку, делая проверку попадания на лист.
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ);
			
			// Инициализация итогов по странице.
			Если НомерСтраницы <> НомерСтраницыПредыдущий Тогда
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
		КонецЦикла;
		
		// Заполнение подвала и итогов.
		ОбластьПодвал.Параметры.СуммаПрописью = НСтр("ru = 'Всего наименований'") + Символы.НПП +ВыборкаТабличнойЧасти.Количество();
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// Блок области
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции  //ПечатьНазначениеСкидокСтроки()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "СкидкиЗаполнитьДействующимиСкидками",, "Скидки", НСтр("ru = 'Заполнить действующими скидками'"));
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("СкидкиЗаполнитьДействующимиСкидками.Видимость",   (НЕ Объект.ХозОперация = Справочники.ХозОперации.НазначениеОбщихСкидок));
	ПараметрыКоманд.Вставить("СкидкиЗаполнитьДействующимиСкидками.Доступность", Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа по заказам контрагенту
//
Функция СкидкиЗаполнитьДействующимиСкидками(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиШапкиСрезПоследних.Скидка,
	|	СкидкиШапкиСрезПоследних.ФлагВытеснения,
	|	СкидкиШапкиСрезПоследних.ЗначениеСкидки,
	|	СкидкиШапкиСрезПоследних.Свойство,
	|	СкидкиШапкиСрезПоследних.ОтСуммыЧека КАК СуммаЧека,
	|	СкидкиШапкиСрезПоследних.ДисконтнаяКарта,
	|	СкидкиШапкиСрезПоследних.ОтСуммыНакопленияНаКарте КАК СуммаНакопления,
	|	СкидкиШапкиСрезПоследних.НачВремя,
	|	СкидкиШапкиСрезПоследних.КонВремя,
	|	СкидкиШапкиСрезПоследних.ДниНедели,
	|	СкидкиШапкиСрезПоследних.ВидПрайсЛистаПодарка,
	|	СкидкиШапкиСрезПоследних.МаксимальнаяСуммаПодарка,
	|	СкидкиШапкиСрезПоследних.ЗалОбслуживания КАК СкладКомпании,
	|	СкидкиШапкиСрезПоследних.ИдентификаторСкидки КАК ИдентификаторСкидки
	|ИЗ
	|	РегистрСведений.СкидкиШапки.СрезПоследних(
	|		&Дата,
	|		ПодразделениеКомпании = &ПодразделениеКомпании
	|		    И Скидка.ВидСкидки = &ВидСкидкиНаДокумент) КАК СкидкиШапкиСрезПоследних
	|ГДЕ
	|	СкидкиШапкиСрезПоследних.Действует
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкидкиШапкиСрезПоследних.Период
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", Новый Граница(Объект.ДатаНачалаДействия, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ВидСкидкиНаДокумент", Перечисления.ВидыСкидок.НаДокумент);
	
	Объект.Скидки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции // СкидкиЗаполнитьДействующимиСкидками()

#КонецЕсли
